export default function PrivacyAndPolicy() {
  return (
    <section className="privacy-and-policy">
      <div className="privacy-and-policy__container">
        <h1>Privacy Policy (Політика конфіденційності)</h1>
        <ol>
          <li>
            <b>Збір інформації</b>
            <ul>
              <li>
                Ми збираємо лише ті дані, які необхідні для обробки замовлень та
                покращення сервісу (ім’я, email, адреса, телефон).
              </li>
              <li>
                Використовуючи сайт ви автоматично даєте згоду на збір ваших
                даних.
              </li>
              <li>Дані збираються легально та з вашої згоди.</li>
            </ul>
          </li>
          <li>
            <b>Використання інформації</b>
            <ul>
              <li>
                Використовуємо дані для оформлення замовлень, доставки товарів
                та комунікації.
              </li>
              <li>
                Також можемо надсилати інформаційні та рекламні матеріали, якщо
                ви дали на це згоду.
              </li>
            </ul>
          </li>
          <li>
            <b>Передача даних третім особам</b>
            <ul>
              <li>
                Ми не передаємо ваші персональні дані стороннім компаніям без
                вашої згоди, крім випадків, передбачених законодавством.
              </li>
              <li>
                Використання платіжних систем може передбачати передачу частини
                даних операторам платежів.
              </li>
            </ul>
          </li>
          <li>
            <b>Зберігання та безпека</b>
            <ul>
              <li>
                Ми застосовуємо заходи безпеки для захисту ваших даних від
                несанкціонованого доступу.
              </li>
            </ul>
          </li>
          <li>
            <b>Ваші права</b>
            <ul>
              <li>
                Ви маєте право переглядати, змінювати або видаляти свої
                персональні дані.
              </li>
              <li>Для цього звертайтесь до нашої служби підтримки.</li>
            </ul>
          </li>
        </ol>
      </div>
    </section>
  );
}
